<div class="main" style="margin: 20px 40px;">
    <h1>Практическая работа №5</h1>
        <ol>
            <li>Создать галерею изображений, состоящую из двух страниц:<br>
                <ul style="margin-left: 40px;">
                    <li>просмотр всех фотографий (уменьшенных копий);</li>
                    <li>просмотр конкретной фотографии (изображение оригинального размера) по ее ID в базе данных.</li>
                </ul>
            </li>
            <li>В базе данных создать таблицу, в которой будет храниться информация о картинках (размер, имя).</li>
            <li>На странице просмотра фотографии полного размера под картинкой должно быть указано число ее просмотров.</li>
            <li>На странице просмотра галереи список фотографий должен быть отсортирован по популярности. Популярность = число кликов по фотографии.</li>
            <li>Сделайте это на движке.</li>
        </ol>
</div>