<?php
// 1. Создать галерею фотографий. Она должна состоять всего из одной странички, на которой пользователь видит все картинки в уменьшенном виде и форму для загрузки нового изображения. При клике на фотографию она должна открыться в браузере в новой вкладке. Размер картинок можно ограничивать с помощью свойства width. Список файлов получить через функцию чтения директории с изображениями. Функция сама должна считать список файлов и построить фотогалерею со ссылками в ней.
// 2. * на странице галереи сделать форму загрузки нового изображения, сделать проверки на тип и размер файла и сделать ресайз изображения и генерацию миниатюры, после загрузки перезагрузить сраницу, чтобы новое изображение появилось на странице. При загрузке изображения необходимо делать проверку на тип и размер файла.
// 3. * сделать задание на движке 4.
?>
<div class="main">
    <h1>Практическая работа №4</h1>
        <h2>Задание 1:</h2>
        <h2>Задание 2:</h2>
        <h2>Задание 3:</h2>
</div>